In [1]:
from db_handler import create_connection,return_query_as_df,execute_query,schema_info,drop_nulls
from lookups import ErrorHandling,InputTypes

db_session = create_connection("dvd_rental","postgres","12345","localhost",5432)
db_session

In [2]:
create_connection("dvd_rental","postgres","123456","localhost",5432)

DB could not connect=connection to server at "localhost" (::1), port 5432 failed: FATAL:  password authentication failed for user "postgres"

'create_connection funtion returned nothing'

In [3]:
return_query_as_df(db_session,'select * from rental')

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  query_df = pd.read_sql_query(sql= query, con=db_session)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-16 02:30:53
1,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-16 02:30:53
2,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-16 02:30:53
3,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-16 02:30:53
4,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-16 02:30:53
...,...,...,...,...,...,...,...
16039,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-16 02:30:53
16040,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-16 02:30:53
16041,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-16 02:30:53
16042,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-16 02:30:53
16043,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53

In [4]:
return_query_as_df(db_session,'select * from ')

query could not be returned as dataframe=Execution failed on sql 'select * from ': syntax error at end of input
LINE 1: select * from
                      ^

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  query_df = pd.read_sql_query(sql= query, con=db_session)

In [5]:
execute_query(db_session,'abcd')

Execution error=syntax error at or near "abcd"
LINE 1: abcd
        ^

In [7]:

schema_info(db_session,'public').head()

                   table_name
0                       actor
1                  actor_info
2               customer_list
3                   film_list
4  nicer_but_slower_film_list

In [8]:
schema_info('x','123')

query could not be returned as dataframe=Using URI string without sqlalchemy installed.

In [9]:
from db_handler import *
from lookups import ErrorHandling,InputTypes

db_session = create_connection("dvd_rental","postgres","12345","localhost",5432)
db_session

In [10]:
drop_nulls(db_session,'select * from rental','SQL').head()

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  query_df = pd.read_sql_query(sql= query, con=db_session)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-16 02:30:53
1,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-16 02:30:53
2,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-16 02:30:53
3,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-16 02:30:53
4,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-16 02:30:53

In [11]:
drop_nulls(db_session,'select * from ','CSV')

Error returning CSV=Invalid file path or buffer object type: <class 'psycopg2.extensions.connection'>

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:72: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  df=pd.read_csv(db_session,data)
c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:72: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df=pd.read_csv(db_session,data)

why

In [12]:
drop_nulls(db_session,'a ','b')

In [13]:
get_shape(db_session,'select * from rental','SQL')

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  query_df = pd.read_sql_query(sql= query, con=db_session)

(16044, 7)

In [14]:
get_shape(db_session,'select * from rental','CSV')

 Error finding CSV shape=Invalid file path or buffer object type: <class 'psycopg2.extensions.connection'>

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:103: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  df=pd.read_csv(db_session,data)
c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:103: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df=pd.read_csv(db_session,data)

In [15]:
drop_duplicates(db_session,'select * from rental','SQL')

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  query_df = pd.read_sql_query(sql= query, con=db_session)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-16 02:30:53
1,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-16 02:30:53
2,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-16 02:30:53
3,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-16 02:30:53
4,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-16 02:30:53
...,...,...,...,...,...,...,...
16039,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-16 02:30:53
16040,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-16 02:30:53
16041,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-16 02:30:53
16042,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-16 02:30:53
16043,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53

In [16]:
drop_duplicates(db_session,'select * from rental','CSV')

Error droping duplicates from csv file=Invalid file path or buffer object type: <class 'psycopg2.extensions.connection'>

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:135: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  df=pd.read_csv(db_session,data)
c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:135: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df=pd.read_csv(db_session,data)

In [17]:
get_length(db_session,'select * from rental','SQL')

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  query_df = pd.read_sql_query(sql= query, con=db_session)

16044

In [18]:
get_length(db_session,'select ','CSV')

 Error finding CSV length=Invalid file path or buffer object type: <class 'psycopg2.extensions.connection'>

c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:168: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  df=pd.read_csv(db_session,data)
c:\Users\User\Desktop\vs_etl\My_ETL_Project_3\db_handler.py:168: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df=pd.read_csv(db_session,data)

In [19]:
from folder_handler import find_csv
directory = r'C:\Users\User\Desktop\vs_etl\ETL_Project_2\ETL_Project'
 

find_csv(directory)

['payment_output.csv']